Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.redshift_password: Reading...
data.aws_ssm_parameter.rds_password: Reading...
data.aws_ssm_parameter.rds_password: Read complete after 1s [id=/environment/team/service/rds/password]
data.aws_ssm_parameter.redshift_password: Read complete after 1s [id=/airflow-deployment/redshift/password/master]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_eip.airflow-deployment-eip will be created
+ resource "aws_eip" "airflow-deployment-eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "airflow-deployment-nat-gateway-eip"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Elastic IP for NAT Gateway"
          + "team"        = "Data platform engineering team"
        }
      + tags_all             = {
          + "Name"        = "airflow-deployment-nat-gateway-eip"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Elastic IP for NAT Gateway"
          + "team"        = "Data platform engineering team"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.airflow-deployment-igw will be created
+ resource "aws_internet_gateway" "airflow-deployment-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "airflow-deployment-igw"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Internet Gateway"
          + "team"        = "Data platform engineering team"
        }
      + tags_all = {
          + "Name"        = "airflow-deployment-igw"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Internet Gateway"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.airflow-deployment-nat-gateway will be created
+ resource "aws_nat_gateway" "airflow-deployment-nat-gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "airflow-deployment-nat-gateway"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "NAT Gateway"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                           = {
          + "Name"        = "airflow-deployment-nat-gateway"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "NAT Gateway"
          + "team"        = "Data platform engineering team"
        }
    }

  # aws_route_table.airflow-deployment-private-route-table will be created
+ resource "aws_route_table" "airflow-deployment-private-route-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "airflow-deployment-private-route-table"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Private Route Table"
          + "team"        = "Data platform engineering team"
        }
      + tags_all         = {
          + "Name"        = "airflow-deployment-private-route-table"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Private Route Table"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.airflow-deployment-public-route-table will be created
+ resource "aws_route_table" "airflow-deployment-public-route-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "airflow-deployment-public-route-table"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Public Route Table"
          + "team"        = "Data platform engineering team"
        }
      + tags_all         = {
          + "Name"        = "airflow-deployment-public-route-table"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Public Route Table"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.airflow-deployment-public-subnet-association will be created
+ resource "aws_route_table_association" "airflow-deployment-public-subnet-association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations["rds-a"] will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations["rds-b"] will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations["rds-c"] will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations["redshift-d"] will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations["redshift-e"] will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations["redshift-f"] will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.airflow-deployment-public-subnet will be created
+ resource "aws_subnet" "airflow-deployment-public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "airflow-deployment-public-subnet"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Public Subnet"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                                       = {
          + "Name"        = "airflow-deployment-public-subnet"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Public Subnet"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnets["rds-a"] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "airflow-deployment-rds-a"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet1 for RDS"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "RDS"
        }
      + tags_all                                       = {
          + "Name"         = "airflow-deployment-rds-a"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet1 for RDS"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "RDS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnets["rds-b"] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "airflow-deployment-rds-b"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet2 for RDS"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "RDS"
        }
      + tags_all                                       = {
          + "Name"         = "airflow-deployment-rds-b"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet2 for RDS"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "RDS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnets["rds-c"] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "airflow-deployment-rds-c"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet3 for RDS"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "RDS"
        }
      + tags_all                                       = {
          + "Name"         = "airflow-deployment-rds-c"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet3 for RDS"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "RDS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnets["redshift-d"] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "airflow-deployment-redshift-d"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet1 for REDSHIFT"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "REDSHIFT"
        }
      + tags_all                                       = {
          + "Name"         = "airflow-deployment-redshift-d"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet1 for REDSHIFT"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "REDSHIFT"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnets["redshift-e"] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "airflow-deployment-redshift-e"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet2 for REDSHIFT"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "REDSHIFT"
        }
      + tags_all                                       = {
          + "Name"         = "airflow-deployment-redshift-e"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet2 for REDSHIFT"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "REDSHIFT"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnets["redshift-f"] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "airflow-deployment-redshift-f"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet3 for REDSHIFT"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "REDSHIFT"
        }
      + tags_all                                       = {
          + "Name"         = "airflow-deployment-redshift-f"
          + "environment"  = "production"
          + "project"      = "airflow-deployment"
          + "service"      = "private subnet3 for REDSHIFT"
          + "team"         = "Data platform engineering team"
          + "vpc_resource" = "REDSHIFT"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.airflow-deployment-vpc will be created
+ resource "aws_vpc" "airflow-deployment-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "airflow-deployment-vpc"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "VPC"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                             = {
          + "Name"        = "airflow-deployment-vpc"
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "VPC"
          + "team"        = "Data platform engineering team"
        }
    }

  # module.airflow_rds.aws_db_instance.rds_instance will be created
+ resource "aws_db_instance" "rds_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "airflow_deployment_db"
      + db_subnet_group_name                  = "airflow-deployment-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "airflow-deployment-db-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "RDS"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                              = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "RDS"
          + "team"        = "Data platform engineering team"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.airflow_rds.aws_db_subnet_group.rds_subnet_group will be created
+ resource "aws_db_subnet_group" "rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "airflow-deployment-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "RDS subnet group"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "RDS subnet group"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id                  = (known after apply)
    }

  # module.airflow_rds.aws_security_group.rds_sg will be created
+ resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "airflow-deployment-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "RDS security group"
          + "team"        = "Data platform engineering team"
        }
      + tags_all               = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "RDS security group"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id                 = (known after apply)
    }

  # module.airflow_redshift.aws_redshift_cluster.redshift_cluster will be created
+ resource "aws_redshift_cluster" "redshift_cluster" {
      + allow_version_upgrade                = true
      + apply_immediately                    = false
      + aqua_configuration_status            = (known after apply)
      + arn                                  = (known after apply)
      + automated_snapshot_retention_period  = 1
      + availability_zone                    = (known after apply)
      + availability_zone_relocation_enabled = false
      + cluster_identifier                   = "airflow-deployment-redshift-cluster"
      + cluster_namespace_arn                = (known after apply)
      + cluster_nodes                        = (known after apply)
      + cluster_parameter_group_name         = (known after apply)
      + cluster_public_key                   = (known after apply)
      + cluster_revision_number              = (known after apply)
      + cluster_subnet_group_name            = "airflow-deployment-redshift-subnet-group"
      + cluster_type                         = "single-node"
      + cluster_version                      = "1.0"
      + database_name                        = "airflowdb"
      + default_iam_role_arn                 = (known after apply)
      + dns_name                             = (known after apply)
      + encrypted                            = false
      + endpoint                             = (known after apply)
      + enhanced_vpc_routing                 = (known after apply)
      + iam_roles                            = (known after apply)
      + id                                   = (known after apply)
      + kms_key_id                           = (known after apply)
      + maintenance_track_name               = "current"
      + manual_snapshot_retention_period     = -1
      + master_password                      = (sensitive value)
      + master_password_secret_arn           = (known after apply)
      + master_password_secret_kms_key_id    = (known after apply)
      + master_password_wo                   = (write-only attribute)
      + master_username                      = "admin"
      + multi_az                             = false
      + node_type                            = "ra3.large"
      + number_of_nodes                      = 1
      + port                                 = 5439
      + preferred_maintenance_window         = (known after apply)
      + publicly_accessible                  = true
      + skip_final_snapshot                  = true
      + tags                                 = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Redshift"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                             = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Redshift"
          + "team"        = "Data platform engineering team"
        }
      + vpc_security_group_ids               = (known after apply)

      + logging (known after apply)

      + snapshot_copy (known after apply)
    }

  # module.airflow_redshift.aws_redshift_subnet_group.redshift_subnet_group will be created
+ resource "aws_redshift_subnet_group" "redshift_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "airflow-deployment-redshift-subnet-group"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Redshift subnet group"
          + "team"        = "Data platform engineering team"
        }
      + tags_all    = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Redshift subnet group"
          + "team"        = "Data platform engineering team"
        }
    }

  # module.airflow_redshift.aws_security_group.redshift_sg will be created
+ resource "aws_security_group" "redshift_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for Redshift cluster"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + from_port        = 5439
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5439
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "airflow-deployment-redshift-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Redshift security group"
          + "team"        = "Data platform engineering team"
        }
      + tags_all               = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "Redshift security group"
          + "team"        = "Data platform engineering team"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws_s3_bucket.aws_s3_bucket.airflow-deployment-s3-bucket will be created
+ resource "aws_s3_bucket" "airflow-deployment-s3-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "airflow-deployment-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "S3 bucket for Airflow deployment"
          + "team"        = "Data platform engineering team"
        }
      + tags_all                    = {
          + "environment" = "production"
          + "project"     = "airflow-deployment"
          + "service"     = "S3 bucket for Airflow deployment"
          + "team"        = "Data platform engineering team"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.aws_s3_bucket.aws_s3_bucket_versioning.versioning will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://9b69840f5ffc:4141/lock?id=Data-Platform-Engineering%252Finfrastructures%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform
  ```
Plan: 28 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```